---
type: WireMaterialTypeSet
namespace: Autodesk.Revit.DB.Electrical
version: 2024
members: 10
tags: [revit-api, class]
---

# WireMaterialTypeSet

`Autodesk.Revit.DB.Electrical.WireMaterialTypeSet` · Revit 2024 · 10 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | WireMaterialTypeSet | — | `public WireMaterialTypeSet ()` |
| Method | Clear | — | `public virtual void Clear ()` |
| Method | Contains | — | `public virtual bool Contains ( WireMaterialType item )` |
| Method | Erase | — | `public virtual int Erase ( WireMaterialType item )` |
| Method | ForwardIterator | — | `public virtual WireMaterialTypeSetIterator ForwardIterator ()` |
| Method | GetEnumerator | — | `public virtual IEnumerator GetEnumerator ()` |
| Method | Insert | — | `public virtual bool Insert ( WireMaterialType item )` |
| Method | ReverseIterator | — | `public virtual WireMaterialTypeSetIterator ReverseIterator ()` |
| Property | IsEmpty | — | `public virtual bool IsEmpty { get ; }` |
| Property | Size | — | `public virtual int Size { get ; }` |